{
    "app": {
        "title": "GWB Analysis",
        "footer": "The sky is the limit © {}",
        "drawer_item": {
            "acc": "ACC",
            "dist": "DIST",
            "fad": "FAD",
            "frag": "FRAG",
            "lm": "LM",
            "mspa": "MSPA",
            "p223": "P223",
            "parc": "PARC",
            "rss": "RSS",
            "spa": "SPA",
            "rcl":"Reclassify",
            "about": "About",
            "licence": "Licence"
        },
        "licence": {
            "title": "User licence",
            "btn": "Accept the term of licence" 
        }
    },
    "reclassify": {
        "title": "Reclassify local rasters",
        "description": "This module will allow you to reclassify your local raster values into a new custom codes. <h2>Usage</h2></br>Navigate over your sepal storage environment and select the input `.tif` image, in the next dropdown use a manual classification if you don't have a classification `.csv` table, otherwise select the corresponding file. </br> Go to the 'Customize Classification' tab in order to create or modify existing classification files, and use them after in the workflow.<br><br>Once you have updated your files, click over the 'Get reclassify table' and choose the target values for each class."
    },
    "acc": {
        "title":  "ACC: Accounting of image objects and areas",
        "description": "This module will conduct the Accounting analysis. Accounting will label and calculate the area of all foreground objects (coded with 2 bytes). The results are spatially explicit maps and tabular summary statistics. Details on the methodology can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Accounting product sheet](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-Objects-Accounting.pdf).",
        "connectivity": "Foreground connectivity",
        "res": "spatial pixel resolution (meters)",
        "thresholds": "Add your area thresholds (up to 5) area thresholds (pixel)",
        "big3pink": "Show 3 largest objects in pink color",
        "options": "Output options",
        "no_connex": "Please select connectivity",
        "no_res": "Please set the resolution",
        "no_thres": "Please provide at least one threshold",
        "no_options": "Please select an option",
        "res_hint": "res must be an integer number > 0"
    },
    "dist": {
        "title": "DIST: Euclidean Distance",
        "description": "This module will conduct the Euclidean Distance analysis. Each pixel will show the shortest distance to the foreground (coded with 2 byte) boundary. Pixels inside a foreground object have a positive distance value while background pixels have a negative distance value. The result are spatially explicit maps and tabular summary statistics. Details on the methodology and input/output options can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Distance](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-Distance-Euclidean.pdf) product sheet."
    },
    "fad": {
        "title": "FAD: Forest Area Density",
        "description": "This module will conduct the fragmentation analysis at five fixed observation scales. Because forest fragmentation is scale-dependent, fragmentation is reported at five observation scales, which allows different observers to make their own choice about scales and threshold of concern. The change of fragmentation across different observation scales provides additional interesting information. Fragmentation is measured by determining the Forest Area Density (FAD) within a shifting, local neighborhood. It can be measured at pixel or patch level. The result are spatially explicit maps and tabular summary statistics. Details on the methodology and input/output options can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Fragmentation](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-Fragmentation-FADFOS.pdf) product sheet.",
        "prescision": "Computation precision",
        "no_prescision": "Please set the prescision"
    },
    "frag": {
        "title": "FRAG: fragmentation",
        "description": "This module will conduct the fragmentation analysis at a user-selected observation scale. This module and its option are similar to GWB_FAD but allow the user to specify a single (or multiple) specific observation scale. The result are spatially explicit maps and tabular summary statistics. Details on the methodology and input/output options can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Fragmentation](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-Fragmentation-FADFOS.pdf) product sheet.",
        "windows": "Observation scale",
        "window_lbl": "Scale {}",
        "invalid_window": "A window should be a odd int in [3, 501]",
        "no_windows": "Please provide at least 1 window size"
    },
    "lm": {
        "title": "LM: Landscape Mosaic",
        "description": "This module will conduct the Landscape Mosaic analysis at a user-selected observation scale. The Landscape Mosaic measures land cover heterogeneity, or human influence, in a tri-polar classification of a location accounting for the relative contributions of the three land cover types Agriculture, Natural, Developed in the area surrounding that location. The result are spatially explicit maps and tabular summary statistics. Details on the methodology and input/output options can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Landscape Mosaic](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-Pattern-LM.pdf) product sheet.",
        "kdim": "square window size (pixels)",
        "no_kdim": "Please provide a square window size"
    },
    "mspa": {
        "title": "MSPA: Morphological Spatial Pattern Analysis",
        "description": "This module will conduct the Morphological Spatial Pattern Analysis. MSPA analyses shape and connectivity and conducts a segmentation of foreground patches in up to 25 feature classes. The result are spatially explicit maps and tabular summary statistics. Details on the methodology and input/output options can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Morphology](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-Pattern-Morphology.pdf) product sheet.",
        "edge_width": "edge width (pixels)",
        "transition": "transition",
        "int_ext": "intext",
        "no_edge_width": "Please provide a positive edge width"

    },
    "p223": {
        "title": "p223: Density (P2), Contagion (P22) or or FG-Adjacency (P23)",
        "description": "This module will conduct the density (P2) or contagion (P22) analysis of foreground objects at a user-selected observation scale (Riitters et al. (2000)). The result are spatially explicit maps and tabular summary statistics. The classification is determined by measurements of forest amount (P2) and connectivity (P22) within the neighborhood that is centered on a subject forest pixel. P2 is the probability that a pixel in the neighborhood is forest, and P22 is the probability that a pixel next to a forest pixel is also forest.",
        "algo": "algorithm"
    },
    "parc": {
        "title": "PARC: Parcellation",
        "description": "This module will conduct the parcellation analysis. This module provides a statistical summary file (txt/csv- format) with details for each unique class found in the image as well as the full image content: class value, total number of objects, total area, degree of parcellation. Details on the methodology and input/output options can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Parcellation](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-Objects-Parcellation.pdf) product sheet."
    },
    "rss": {
        "title": "RSS: Restoration Status Summary",
        "description": "This module will conduct the Restoration Status Summary analysis. It will calculate key attributes of the current network status, composed of foreground (forest) patches and it provides the normalized degree of network coherence. The result are tabular summary statistics. Details on the methodology and input/output options can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Restoration Planner](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-RestorationPlanner.pdf) product sheet."
    },
    "spa": {
        "title": "SPA: Simplified Pattern Analysis",
        "description": "This module will conduct the Simplified Pattern Analysis. SPA analyses shape and conducts a segmentation of foreground patches into 2, 3, 5, or 6 feature classes. The result are spatially explicit maps and tabular summary statistics. GWB_SPA is a simpler version of GWB_MSPA. Details on the methodology and input/output options can be found in the (mac: right+click or windows: cmd+click to open in new tab) [Morphology](https://ies-ows.jrc.ec.europa.eu/gtb/GTB/psheets/GTB-Pattern-Morphology.pdf) product sheet.",
        "nb_classes": "number of pattern classes",
        "no_class": "Please prove a positive number of pattern classes"
    },
    "rec": {
        "title": "REC: Recoding",
        "description": "This module will recode categorical land cover classes."
    },
    "requirement": [
        "Provide a byte-formatted input image. The image must contain at least 2 different classes. 0 will be considered as missing data.",
        "",
        "Provide a byte-formatted input image. Recode the classes into the following 2 classes : background (nonforest), foreground (forest). All remaining classes will be considered as missing data.",
        "Provide a byte-formatted input image. Recode the classes into the 3 dominant land cover classes. All remaining classes will be considered as missing data.",
        "Provide a byte-formatted input image. Recode the classes into the following 4 classes: background (nonforest), foreground (forest), special background 1 (optional, e.g. water) and special background 2 (optional). All remaining classes will be considered as missing data.",
        "Provide a byte-formatted input image. Recode the classes into the 3 following classes : background (nonforest), foreground (forest), special background 1 (for P23 only). All remaining classes will be considered as missing data."
    ],
    "bin": {
        "btn": "Convert the input image classes",
        "title": "Select input map classes",
        "file_exist": "the file {} already exists, no new bin maps have been created",
        "reclassify_exist": "The file {} already exists.",
        "no_exists" : "The provided {} file doesn't exists.",
        "running": "The bin map is being processed",
        "finished": "the bin map is ready to be used",
        "no_file": "Please provide a file to be reclassified",
        "no_classes": "you didn't provided any classes",
        "overlap": "At least one value have been used in multiple classes",
        "no_bin": "Please provide a bin map using the first process tile",
        "default": {
            "btn": "Download test dataset",
            "msg": "the test files \"{}\" and \"{}\" have been added to the \"downloads\" folder",
            "tooltip": "Click the button below to download the test files `clc3class.tif` and `example.tif` into the folder `~/downloads/`."
        }
    },
    "gwb": {
        "start": "Starting the {} process",
        "file_exist": "The process {} has already been launched on {} with the following parameters : {}"
    },
    "process": {
        "btn": "start the {} process"
    }
}
